<a href="https://colab.research.google.com/github/Tanu-N-Prabhu/Python/blob/master/Pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Creating a pandas DataFrame**

In [0]:
import pandas as pd
data = {'Name':['Tanu', 'Ashika', 'Ashwin', 'Sourabh', 'Mohit'],
        'Age': [23, 24, 22, 10, 19]}
data

{'Age': [23, 24, 22, 10, 19],
 'Name': ['Tanu', 'Ashika', 'Ashwin', 'Sourabh', 'Mohit']}

In [0]:
df = pd.DataFrame(data)
df

      Name  Age
0     Tanu   23
1   Ashika   24
2   Ashwin   22
3  Sourabh   10
4    Mohit   19

**Displaying the specific columns.**

In [0]:
df[["Name"]]

      Name
0     Tanu
1   Ashika
2   Ashwin
3  Sourabh
4    Mohit

**Selecting a single row**

In [0]:
df.loc[0]

Name    Tanu
Age       23
Name: 0, dtype: object

**Checking for the missing values.**

In [0]:
import pandas as pd
import numpy as np

dict ={'First name':['Tanu', np.nan],
       'Age': [23, np.nan]}
dict

{'Age': [23, nan], 'First name': ['Tanu', nan]}

In [0]:
df = pd.DataFrame(dict)
df

  First name   Age
0       Tanu  23.0
1        NaN   NaN

In [0]:
df.isnull()

   First name    Age
0       False  False
1        True   True

**Filling the missing values.**

In [0]:
df.fillna(0)

  First name   Age
0       Tanu  23.0
1          0   0.0